{"extracted_information": "Credit repair is legal in all 50 U.S. states and is primarily governed by two federal laws: the Fair Credit Reporting Act (FCRA) and the Credit Repair Organizations Act (CROA). These laws establish consumer rights regarding credit report accuracy and regulate the credit repair industry to prevent fraudulent practices. Additionally, almost every state has its own laws that further regulate credit repair companies.", "specifications": {}, "pricing": {"disclosure_requirement": "Under the Credit Repair Organizations Act (CROA), credit repair companies must provide a detailed disclosure of what their services do and how much they cost before a consumer signs a contract."}, "features": [{"law_name": "Fair Credit Reporting Act (FCRA)", "year_established": 1970, "consumer_rights": ["Limits on who can view your credit report (e.g., loan/credit applications, insurance, court cases, employment, bank closures).", "Requirement for consumer authorization for a company to review their credit report in most cases.", "Limitations on what information can be listed in your credit report and for how long.", "Guarantee of accuracy: Credit Reporting Agencies (CRAs) must take every action possible to ensure information is accurate.", "Right to dispute inaccurate items: CRAs must accept disputes free of charge.", "CRAs must respond to disputes within 30 days (with an additional 15 days for follow-up if needed).", "The bureau must contact the lender or original provider of the information to verify it within 5 business days of receiving a dispute.", "If a disputed item cannot be verified, it must be removed from the credit report.", "Upon removal of a disputed item, the CRA must provide a free copy of the updated credit report.", "If a disputed item is verified and the dispute rejected, the consumer can include a 100-word statement in their credit report to explain their side.", "Right to a free annual credit report from each credit bureau.", "Creation of the fraud alert process to protect against identity compromise."]}, {"law_name": "Credit Repair Organizations Act (CROA)", "year_passed": 1996, "purpose": "Regulates the credit repair industry, granting consumers the right to authorize a qualified third party to make disputes on their behalf.", "definition_of_credit_repair_company": "An entity that sells services related to maintaining accuracy in a consumer’s credit report. This definition excludes financial institutions, lenders, credit card issuers, and non-profit organizations like consumer credit counseling agencies.", "prohibited_practices": ["Making false statements about credit scores or how much their service can improve a score.", "Altering a consumer's identity or advising them to do so to hide negative information.", "Making untrue or misleading claims about the services they provide.", "Engaging in any practice that would constitute fraud under other federal laws.", "Charging advance fees; services must be fully performed as paid for."], "consumer_protections_and_rights": ["Right to detailed disclosure of services and cost before signing a contract.", "Protection from fees if the consumer decides to cancel services.", "Prohibition of companies making consumers sign away their rights to cancel or sue.", "Protects consumer rights to seek damages if the service is not up to standards.", "Gives consumers the right to sue a company for up to five years after the service was provided."]}, {"law_name": "State Laws Regulating Credit Repair", "provisions": ["Almost every state has its own credit repair laws in addition to federal laws.", "Many state laws stipulate that a credit repair company must have a state-licensed attorney on staff.", "Most states require credit repair companies to be bonded to work for clients in that particular state.", "States can establish specific systems for when fees can be assessed and define prohibited acts for credit repair companies.", "States can set specific disclaimers and disclosures that are legally required.", "States can establish standards for advertising and claims made during sales calls."]}], "statistics": {"cfpb_complaints_2018": {"total_complaints": "Over 1,000", "breakdown": {"fraud_and_scams": "One-third (approx. 33.3%)", "misleading_advertising_claims": "16%", "unexpected_fees": "12%", "did_not_receive_proper_disclosures": "10%"}}}, "temporal_info": {"fcra_established_year": 1970, "croa_passed_year": 1996, "article_published_date": "March 5, 2015", "article_updated_date": "May 20, 2025", "cfpb_statistics_year": 2018}, "geographical_data": {"legality_across_states": "Credit repair is legal in all 50 states.", "state_specific_regulations": "Almost every state has its own credit repair laws, which may require state-licensed attorneys or bonding. Consumers are advised to contact their State Attorney General’s office for specific state protections."}, "references": ["https://files.consumerfinance.gov/f/documents/cfpb_consumer-response-annual-report_2018.pdf (Source for CFPB complaint statistics)"]}